# Custom YOLO11 Architecture for NVIDIA H100 Training & Jetson Edge Inference
# Includes: P2 Small Object Head (1/4 scale) and TRT-Compatible CBAM modules

nc: 4 # 0: 2_wheeler, 1: 3_wheeler, 2: 4_wheeler, 3: unknown (adjustable via dataset config)

scales:
  # [depth, width, max_channels]
  m: [0.67, 0.75, 768] # YOLO11m scale

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]]   # 9
  - [-1, 1, CBAM, [1024]]      # 10: Inject CBAM before Neck (TRT safe)

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3)

  # Extend to P2 for small object detection
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P2
  - [-1, 2, C3k2, [128, False]] # 19 (P2 output)
  - [-1, 1, CBAM, [128]]        # 20: CBAM for P2 (Small Object attention)

  # Downsample paths
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 16], 1, Concat, [1]] # cat head P3
  - [-1, 2, C3k2, [256, False]] # 23 (P3 output)
  
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 26 (P4 output)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 29 (P5 output)

  # Detection Head with 4 layers (P2, P3, P4, P5)
  - [[20, 23, 26, 29], 1, Detect, [nc]] # 30
